vestaCases/V_S-Mid/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    faceZoneSource;
        type    faceSet;
        action  new;

        source  boxToFace;
        sourceInfo
        {
            box (-.15 15.746 55.5) (.15 18.746 67.5);  // thin x-slice, defines face area
        }
    }

    {
        name    turbLoc;
        type    faceZoneSet;
        action  new;

        source  setToFaceZone;
        sourceInfo
        {
            faceSet faceZoneSource;
        }
    }
);

// ************************************************************************* //